import React from 'react';
import Pdf from "react-to-pdf";
const ref=React.createRef()
const PDF=(props)=>{
    return(
        <>
            <div  ref={ref}>
            <ul>



           <h3>-प्रतिज्ञापत्र-</h3>  
 (खंडपडल्याचा बाबिचा प्रतिज्ञा लखे )
मा. काययकारी दडं ातधकारी िहसील कायायलय अमळनरे यांच्या समोर. 
ददन ांक :- 15/02/2022.
 मी श्री.रतिक जब्बार शाह वय:- 28, धांद :- दिक्षण, र :- नांद्री , त :- अमळनरे,
दि:- जळगाव. क रणेमी सत्य प्रदतज्ञ वर दिहून देतो की, 
मी KBS’s College of Engg.&Technology,North,Maharashtra 
Knowledge City Bambhori,Jalgaon येथेइ. B.E (Computer Engg.) वी 
ची परीक्ष :- December 2019. मध्येददिी होती. त्य त मी पास झ िो. त्य नांतर म झी 
आदथिक पररदथथदत ही दिक्षण योग्य नसल्य मुळेमी पुढीि दिक्षण घेऊ िकिो न ही.
 मी सन - 2019 पासून तेसन - 2021 आि पयंत मी कोणत्य ही / मह दवद्य िय त 
अथव ख िगी सांथथेत प्रवेि घेति न ही. अथव सरक री / दनमसरक री सांथथेत नोकरी
केिेिी न ही. सदरच प्रदतज्ञिेख मी पुढीि दिक्षणक मी करुन देत आहे. व फी सवित
दमळणेक मी करुन देत आहे.
 वरीि म दहती खोटी दनघ ल्य स मी आय. पी. सी किम 199 व 200 य मधीि गुन्ह स
मी प त्र र दहि य ची म ि ि णीव आह

<h3> महाराष्ट्र शासन<br/>
(शासनननर्णय क्रमाांक :- आर .टी.एस.२०१८/प्र.क्र.१४५/आस्था.५)
नद .11/02/2022.
Annexure वयाबाबत स्वयांघोषर्ापत्र ( मराठी)
</h3>

            <p>मी , {props.s1} {props.fullName} श्री. नवठ्ठल दयाराम पाटील , याांची पत्नी , वय {props.age},
             धांदा. {props.occupation}, रा. {props.village} बु. , ता . {props.taluka}, जि . {props.district}
              घोजित करतो की , वरील सवव माजिती माझ्या व्यजिगत माजिती व समिुतीनुसार खरी आिे . सदर माजिती खोटी 
              आढळून आल्यास , भारतीय दांड सांजित १९६० कलम १९९ कलम व २०० व अन्य / सांबांजधत कायद्यानुसार 
              माझ्यावर खटला भरला िाईल व त्यानुसार 
              मी जिक्षेस पात्र राजिन याांची मला पूणव िाणीव आिे . </p>
             
              
                {props.fatherName?<li>Father Name: {props.s2} {props.fatherName}</li>:null}
    


                <li></li>
            </ul>
              
              
            
            </div>


            <Pdf targetRef={ref} filename='post.pdf'>
                {({ toPdf })=><button onClick={toPdf} style={{backgroundColor:"#000080",color:"white"}}>Capture as PDF</button>}

            </Pdf>
        </>
    )
}
export default PDF;